[


    {
	"teamName": "Red Solo KUPP",
	"description": "It’s Jeff’s world, we’re all just living in it. The only undefeated team left and currently averaging 15 more points per game than anyone else in the league. What kind of a simulation are we living in where the best QB is black and the best WR is white? Kyler Murray might run like a toddler that stole something, but he’s a fantasy football dream. I don’t want to say “I called it” but I had Jeff ranked #1 in the first power rankings this year. I’ve always believed.  ",
	"record": "3-0",
	"managerName": "Jeff"
  },


     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Najee Harris had 19 targets last week. By my half-assed Google search research, that’s the second-most all-time by a RB in a single game. And “Captain Fat Fuck, Leader of Men” Ben Roethlisberger has looked pretty lackluster to begin the year - he might be forcing targets to Najee the rest of the year even if he says stop. Because nobody can tell Big Ben no. Tom Brady is the number 1 QB thus far at age 44. It’s not even fun to hate on him any more.  ",
	"record": "2-1",
	"managerName": "Steven"
  },



  	{
	"teamName": "Corn Julio",
	"description": "I can’t tell you how cathartic it felt to beat Schempp this week. Talk about David vs. Goliath or Luke vs. Darth Vader. It’s like if Anne Frank herself got to personally shoot Hitler in the temple. Corn Julio continues to steal wins against the opposition and I continue to commit time theft while writing these power rankings. Davante Adams won’t let no damn concussion keep him out of the game. Junior Seau was lying - CTE isn’t real, the Packers had a football game to win so he was back on the field catching balls as soon as the smelling salts were cracked open.  ",
	"record": "2-1",
	"managerName": "Dom"
  },

      {
	"teamName": "White Justin Fields",
	"description": "Justin Herbert outplayed Patrick Mahomes and took home the win in Arrowhead last week. Imagine reading that sentence at the start of last season. And Derrick Henry “PPR God” has more receptions than Alvin Kamara this year. Not to mention CEH finally breaks out after Andy traded him away. Everything's coming up Luke right now. If AJ Brown and Julio Jones sit out this week, Tractorcito might be forced to run 40 times against the Jets on Sunday. I’d be shitting my pants if I were Quis right now.    ",
		"record": "2-1",
	"managerName": "Luke"
  },


    {
	"teamName": "Christian Mingle",
	"description": "”Do not be afraid of what you are about to suffer. I tell you, the devil will put some of you in prison to test you, and you will suffer persecution for ten days. Be faithful, even to the point of death, and I will give you life as your victor’s crown.” Revelations 2:10. Talk about persecution, Jeff absolutely smote Marquin to the tune of 153.94 points. While Messiah McCaffrey is likely sidelined another week, will the team keep the faith or sit on their balls in hell? Don’t look now, but Darren Waller is starting to come down from his high in Week 1. Could be a temporary relapse, we’ll be waiting on pins and needles to see. ",
	"record": "2-1",
	"managerName": "Marquin"
  },

    {
	"teamName": "Touchdown My Pants",
	"description": "Fuckers in school telling me, always in the barber shop 'Chief Zeke ain't 'bout this, Zeke ain't 'bout that' My boy a BD on fucking Lamron and them. They say that [friend] don't be putting in no work. Shut the fuck up, y'all [friends[ ain't know shit. I was told that Elliot was washed, the Cowboys O-Line was bad, and that Tony Pollard was the future. Evidently that wasn’t true. I’m having a hard time keeping track of who is on Dylan’s team week by week. You’ll have to use your imagination. Just insert your own joke here about whatever flavor of the week guy Touchdown My Pants traded for this week and we’ll call it good." ,
	"record": "2-1",
	"managerName": "Dylan"
  },




    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "End-Zone-io Gibson saved Bob’s ass with a 73-yard TD reception despite not really doing anything else all day. Bob snuck out the win like he snuck Bud Harry’s into my hand Saturday night.  Stafford loves his breakfast boy Cooper Kupp, and hates Robert Woods like Kelly Stafford hates Big Gretch. Don’t look now but Bob is 2-1 and has the number 1 waiver priority. A win against Schempp this week and a major injury to a starting RB could let him take advantage of the rest of the league pretty quickly.   ",
	"record": "2-1",
	"managerName": "Bob"
  },






  {
	"teamName": "Tim Duncan",
	"description": "Bit of a bad break for The Führer to go up against the people’s champion this week. Knowing how fantasy football goes, Nick Chubb will break his leg and newly-acquired Tim Duncan RB Kareem Hunt will go Super Saiyan the rest of the season. Did you know that Joe Mixon has the 2nd most rushing attempts this year? And the second most rushing yards this year? Evidently Schempp didn’t know because he essentially traded him for George Kittle. Schempp’s climb back to the top of the power rankings is inevitable so enjoy it while you can.    ",
	"record": "1-2",
	"managerName": "Schempp"
  },





      {
	"teamName": "Playoff Lenny", 
	"description": "A 41-point performance from Josh Allen squandered by the rest of the Playoff Lenny. If Stefon Diggs keeps playing this soft, he’ll lose the right to call himself “Stefon” and will have to go by “Steven” until he figures his shit out. Quis is going to keep rolling out Leonard Fournette in his starting lineup until things change. Forget about him averaging 7.6 points per game, or how the Bucs never run the ball. It has to pay off some day, right?  " , 
	"record": "1-2",
	"managerName": "Marquis"

  },


    {
	"teamName": "Tucker? I barely know her",
	"description": "Nick can’t catch a break. Teams are averaging 143 points per game against him and his limp dick team simply can’t keep up. Fantasy football is a game of luck, and Nick’’s luck has landed him in an 0-3 hole to start the year despite being 4th in points scored. Statistically, Nick is due for a win this week. But noted fantasy football analyst Joseph Stalin once said, “A single loss is a tragedy; 14 straight losses is a statistic.” ",
	"record": "0-3",
	"managerName": "Nick"
  },



    {
	"teamName": "Whole Lotta Redzone",
	"description": "Andy is rapidly approaching the Rage Quit portion of the season with more question marks in his starting lineup than that one meme of Swaggy P. Michael Thomas may look like a mix between 21 Savage and Squidward’s House, but he’s a valuable asset sitting on IR right now. Will Andy hold on to him in the hopes that he returns to his old self with Jameis at QB or will he look to trade him and grab some VALUE now to turn this ship around? Nick Chubb is a damn good running back, but seems allergic to catching the ball. Thank god we’re playing 0.5 PPR. ",
	"record": "1-2",
	"managerName": "Andy"
  },  

 


    {
	"teamName": "You Sunk My Blankenship",
	"description": "You’d think one of your groomsmen would throw you a bone on the weekend of your wedding and let you win in fantasy. Apparently Bob didn’t get the memo and Sunk this Blankenship to an 0-3 start.. Sam’s RB room is looking depleted and the “Questionable” tag is looming large over a few members of his starting lineup. Still, each game for Sam’s team this year has been close, and the roster still looks strong if everyone is healthy. I wouldn’t write him off just yet. ",
	"record": "0-3",
	"managerName": "Sam"
  }





]



