[




      {
	"teamName": "White Justin Fields",
	"description": "A new power rankings leader emerges as Luke continues his slaughter of the rest of the league. Derrick Henry has been otherworldly to start the year and is on pace for back-to-back 2,000 rushing yard seasons. The rest of Luke’s team has been solid all around, Herbert the Pervert groped the Browns’ defense to the tune of 5 total TDs last week and was Week 5’s TOP scorer. A matchup between the first place and last place teams this week could be a massacre waiting to happen.  ",
		"record": "4-1",
	"managerName": "Luke"
  },

    {
	"teamName": "Red Solo KUPP",
	"description": "One loss could be written off as a fluke, but two losses in a row is a streak. And in fantasy football, just like wearing whitey-tighties, you want to avoid sliding streaks at all costs. Jeff makes a big move this week by dealing Nuk to Dylan for Cream Hunt. Hopkins has been solid this year but hasn’t seen the production or targets he has seen in past seasons. It’s a gamble, but if this moves pays off Red Solo KUPP’s running back room could be downright frightening when Barkley comes back.  ",
	"record": "3-2",
	"managerName": "Jeff"
  },

     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Mike Evans is the definition of an Explode or Cum player AKA Boom or Bust. Following up last week’s 113 yards and 2 TDs bombing is a pathetic excuse of ejaculation in the form of 2 total catches for 27 yards in Thursday Night Football. Tom Brady led last week’s crushing of my hopes and dreams with 42 points and Najee and Chase have been by far the best offensive rookies in the NFL this year. If Steve wants to keep the momentum up and his dick hard this week, he’ll need to beat Week 5’s high scorer: Robert Patty Sanders.   ",
	"record": "3-2",
	"managerName": "Steven"
  },





  	{
	"teamName": "Corn Julio",
	"description": "Streaming QBs is so much damn fun, I recommend that everyone tries it. You might find yourself rooting for the truly detestable, virgin Kirk Cousins against your favorite team and be doubly disappointed when he plays like dog dick and still beats the Lions. Tyreek and Davante have been as good as advertised this year and have kept me competitive each week. But without some more consistent RB play this year, each week could be a toss up.  ",
	"record": "3-2",
	"managerName": "Dom"
  },

    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "Sanders’ team last week was finger lickin’,  finger lickin’,  finger lickin’,  finger lickin’ good and served up Jeff’s team with his own secret blend of herbs and spices. Mark Andrews’ 36 points weren’t even needed to beat Jeff’s total of 122 points and secure Bob the win and catapult him up in the standings. No love lost in a rivalry matchup with Steve this week. Winner solidifies their team as a playoff contender and a threat to win the league. Loser sits on their own balls in hell.     ",
	"record": "3-2",
	"managerName": "Bob"
  },



  {
	"teamName": "Tim Duncan",
	"description": "Schempp squeezed out the victory against Sam last week and heads into week 6 on a two game win streak. Kamara on BYE, Kittle on the IR, Claypool and Mixon are questionable - the odds are stacked against Tim Duncan. But like history has taught us time and time again, don’t count Schempp out. And speaking of history, quick question for you history buffs reading this. Which do you think will turn out as the more crucial mistake for Hitler? Deciding to start a land war in Russia in 1941 or trading Kareem Hunt?  ",
	"record": "3-2",
	"managerName": "Schempp"
  },
    {
	"teamName": "Christian Mingle",
	"description": "Highly anticipated matchup between Marquin and Marquis this week. Call in the Evans Bowl. And just like the Evans’ toilet Bowl, someone will be getting shit on this week. Marquin’s dependency on Waller and the Raiders defense could be problematic now that Jon Gruden is cancelled. Gruden definitely should have resigned after hitting for the old white guy cycle in offending minorities, gays, and women. But the outrage over offending Roger Goodell is a bit much. If I were forced to resign for insulting or calling our lovely commissioner Schempp a slur, I’d have been kicked out of the league a dozen times already.   ",
	"record": "3-2",
	"managerName": "Marquin"
  },





    {
	"teamName": "Touchdown My Pants",
	"description": "Dylan continues to get hate from power rankings voters: he’s 4th in standings and 8th in power rankings. Has his popularity taken a hit because of the barrage of low ball trade offers he makes every week or do voters have their doubts about a backfield of Zeke and Tony Pollard starting at the same time? Hopkins is a solid pickup and a bonafide WR1 the rest of the schedule. But RBs are scarce and finding a decent option on the Waiver Wire is harder than Aaron Rogers watching Broke Back Mountain.   " ,
	"record": "3-2",
	"managerName": "Dylan"
  },


    {
	"teamName": "Whole Lotta Redzone",
	"description": "BYE week hell is here for Andy and with Chubb being ruled out, options are limited for replacement players. A word of advice, make sure when you’re looking for Nick Chubb news on Twitter that you make sure you spell his last name with two ‘Bs”. There are a surprising number of fat dudes named Nick on Twitter showing off their chub. Jalen Hurts is following in the steps of Blake Bortles as the new king of garbage time points, will he be enough to beat Corn Julio this week?   ",
	"record": "3-2",
	"managerName": "Andy"
  },  





      {
	"teamName": "Playoff Lenny", 
	"description": "The older and more mature half of the Evans battle this week, Quis will look to build on his absolute domination of Nick last week by channeling his inner Mike Hart and calling out little brother in Week 6. Jonathan Taylor Thomas has shown a great deal of Home Improvement since the slow start to the year and looks like an excellent RB1. And I must apologize publicly and formally to Leonard Fournette. He’s had 3 consecutive strong weeks and is an absolute steal for an 8th round RB. While he’s outside of the 3-2 rat race for now, a win will put Playoff Lenny right back into the thick of things.   " , 
	"record": "2-3",
	"managerName": "Marquis"

  },


    {
	"teamName": "Tucker? I barely know her",
	"description": "The only positive thing I can think of with an 0-5 start is that you’re not alone. Nick’s team has some solid pieces and isn’t totally irredeemable, but things will need to change soon if he wants to salvage this season. With the least amount of total transactions on the year, maybe it’s a question of effort level on the manager’s side about righting the ship and getting back on course. I have as little faith in Cole Beasley as Cole Beasley has in vaccine science, maybe sitting his ass on the bench will help turn things around.  ",
	"record": "0-5",
	"managerName": "Nick"
  },




 


    {
	"teamName": "Rodrigo BlankenDICK",
	"description": "Heartbreaking loss against Schempp that can be solely blamed on Rodrigo last week. Kyle Pitts was really with the shits and tore the Jets to bits before he called it quits on Sunday morning, but it still wasn’t enough to make up for Blankenship missing three different kicks against the Ravens. At least Sam has Mattison to handcuff Dalvin, because the Zeke for Cook trade looked lopsided in week 2 and has actually turned out the complete opposite way. I don’t think it’s totally unreasonable to say that Sam or Nick can make the playoffs if they go on a win streak starting right now, but they will need to start scoring some points if they want that to happen.    ",
	"record": "0-5",
	"managerName": "Sam"
  }





]
