

[




      {
	"teamName": "White Justin Fields",
	"description": "<a href=“images/sam.png”> Sam looking at this 0-7 record dahahahahaa</a>" , 
	"record": "6-1",
	"managerName": "Luke"
  },  



    {
	"teamName": "Red Solo KUPP",
	"description": "Cooper continues to KUPP his opponents’ balls in his hands while cementing himself as the undisputed #1 WR of the year. After a plethora of injuries and BYEs have left his team short-handed, Jeffrey was spooked enough to trade off his 1st round pick for peanuts so that he can at least start someone this week. People can bitch and complain all they want, but time and time again we are proven wrong about what trades are considered fair or unfair. Only time will reveal whether this is a galaxy-brain move, or a smooth-brain move.  ",
	"record": "4-2",
	"managerName": "Jeff"
  },

     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Steve continues to roll and pick up W’s led by Najee “Do the Ground Work” Harris who had the Seahawks “on his testicles: tastes like it’s edible” in week 6. D’Ernest will earnestly try to earn his spot in Steve’s starting lineup with the rest of the Browns team starting to look like a graveyard of injuries. These very important BYE week hell games will differentiate the men from the boys. Is Steve or Schempp the man in this situation? ",
	"record": "4-2",
	"managerName": "Steven"
  },





  	{
	"teamName": "Corn Julio",
	"description": "Not even a negative output from the Broncos’ defense could keep me down this week. Noah was FANTastic and Antonio Brown has looked like the AB of old the last few weeks. Kararius Toney getting injured right after I burned my waiver claim on him made my dick a little sad, but he had 3 catches on 6 snaps before he went down. If he comes back healthy quickly, I think the Giants are going to force feed him. And if I’m wrong, at least he’s a guy with a funny name who looks like Chief Keef without eyebrows that can be a good team mascot.   ",
	"record": "4-2",
	"managerName": "Dom"
  },

      {
	"teamName": "Playoff Lenny", 
	"description": "The valiant victor of the Evans Bowl and the past week’s top point scorer, Marquis makes quite the leap in power rankings and league standings. Spurred on by huge weeks from Josh Allen, CD Lamb, and Jonathan Taylor, Marquis’ absolute drubbing off his opponent by 70 points is the largest margin of victory so far this season. Thursday Night Lenny downright abused the Eagles defense and will come into the next week well-rested and hungry for more. Quis will need a big output if he wants to make up for BYE weeks for Allen, Diggs and Lamb.  " , 
	"record": "3-3",
	"managerName": "Marquis"

  },

    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "A sorry-ass output from Bob in week 6 spurned a big trade between GUNCLE and everyone’s favorite league <s>dictator</s> commissioner Schempp. Bob is going to have to learn the same lesson that 1940’s imperialist Japan had to learn the hard way: if you try to help out Hitler, you’re gonna get your ass blown up. In all seriousness, I like the trade for Bob I think. Mixon is a solid RB and getting both AJ Brown and Amari Cooper will hopefully make up for the loss of Ekeler and Woods.   ",
	"record": "3-3",
	"managerName": "Bob"
  },



  {
	"teamName": "Tim Duncan",
	"description": "Commenting on Tim Duncan’s uninspired week 6 result including limp-dicked performances from Chase Claypool and Amari Cooper is not the important thing that happened in the past week. The real story is the complete team cum swap between Schempp and Bob that was processed today. Year after year, Schempp turns a sub-par drafted team into an absolutely menacing juggernaut of a team. Somehow, other teams line up each year to trade with him, despite the historical precedent of Schempp fleecing the shit out of them. We’ll try not to freak out until the games actually shake out, but a RB backfield of Alvin Kamara and Autism Ekeler is absolutely ridiculous. Give him the trophy now.     ",
	"record": "3-3",
	"managerName": "Schempp"
  },

    {
	"teamName": "Christian Mingle",
	"description": "A loss for Marquin last week was a loss for Little Brothers everywhere. Getting absolutely mushroom stamped by your older sibling is the ultimate embarrassment. Darren Waller appeared to once be addicted to targets, but looks to have sobered up significantly compared to week 1. Maybe if he falls back off the wagon, Quin can muster up some points and reclaim his honor. The CMC trade is one of the biggest trades this year, but a moment to celebrate nonetheless. 160 years ago, the concept of a black guy getting to auction off a white guy from Carolina to the highest bidder would be backwards. And look at us now. I call that progress.   ",
	"record": "3-3",
	"managerName": "Marquin"
  },

    {
	"teamName": "Whole Lotta Redzone",
	"description": "A respectable point total considering the circumstances, but not enough to grab the win. Brandon Bolden was a bold choice to start at RB, but 11 total snaps and 0.7 total points were costly in Andy’s point total. But the CPat/Mike Davis BBC gangbang is back this week, Chubb and Michael Thomas will be back soon - things can turn around.. It doesn’t even feel good to make fun of Allen Robinson anymore. Maybe against the crippled Tampa Bay secondary he can finally bust out this week, but at this point I’d rather start an actual cripple at WR. Or at least one with a little ‘tism (i.e. - Nelson Agholor).  ",
	"record": "3-3",
	"managerName": "Andy"
  },  



    {
	"teamName": "Touchdown My Pants",
	"description": "What kind of That’s So Raven bullshit is Dylan on where he successfully flipped Hunt for Hopkins and immediately following up with two TDs for Hopkins and an multiple week injury for Hunt. He can see into the future and is finessing other teams. But two losses in a row now and continuing to slide in the power rankings, things are starting to look bleak for Touchdown My Pants. Can he turn the ship around without Zeke this week or will the slide continue against Quin’s newly retooled and hungry team? It all rests on the shoulders of the hardest working white man in America… Hunter Renfrow.  " ,
	"record": "3-3",
	"managerName": "Dylan"
  },


    {
	"teamName": "Tucker? I barely know her",
	"description": "Nick finally popped his win cherry in week 6 and moves from “completely unsalvageable season” to “still pretty unsalvageable season”. Mahomes and Aaron Jones have been the saving grace of Nick’s season and continue to put up solid point totals each week. But until he learns the art of fantasy football defense, that Points Against total will continue to grow each week just like Luke’s pants grow tighter when anyone says that word that rhymes with grade. Interestingly, last week’s matchup between Dylan and Nick was a matchup between the team with the least points against vs. the team with the most points against. Considering the result, maybe it’s safe to say fantasy football is actually really dependent on luck? Who would have thought.  ",
	"record": "1-5",
	"managerName": "Nick"
  },




 


    {
	"teamName": "Oscar Meyers ",
	"description": "More like Risky Seals-Jones, am I right? The risk paid off for Sam when he caught a TD against Washington, but it still was not enough to beat Luke. It’s lonely at the bottom now, with the only defeated team left being Oscar Meyers. But Sam is a true testament that the only way to get over the season long gamble of fantasy football is to also lose money every week on a fat parlay. The real tough reality of the situation is that beating Jeff this week looks like quite the tall order now. With BYEs and injuries all over the place, Sam will be forced to scrape the bottom of the barrel for RBs unless he makes a trade. Other teams will be salivating over Cook if he’s on the table.   ",
	"record": "0-6",
	"managerName": "Sam"
  }





]
