[


    {
	"teamName": "Red Solo KUPP",
	"description": "Damn. Can’t do much when Tyreek Hill unleashes his inner domestic abuser to the tune of 42.1 points. Despite taking the L, Jeff remains first in our power rankings this week. Strong showings from James Robinson and Saquan Barkley will continue to put Jeff in the number 1 seed conversation all year. We’ll see if he can turn the tides this week and put Bob in his place.  ",
	"record": "3-1",
	"managerName": "Jeff"
  },

      {
	"teamName": "White Justin Fields",
	"description": "Started from the bottom, now we’re here. In Week 2’s rankings, Luke was dead last in the standings and it seemed like all hope was lost. But like a phoenix rising from the ashes, White Justin Fields has emerged once more riding on the back of Derrick Henry and leads the league in Points Scored. Luke’s team has been a buzzsaw in the last 3 weeks, averaging over 148 points per game including two weeks scoring the highest mark in the league. Will he continue to put out like the town bicycle, or will his players grow tired of the constant trade rumors and backend deals and stop playing hard for their coach?    ",
		"record": "3-1",
	"managerName": "Luke"
  },





  	{
	"teamName": "Corn Julio",
	"description": "And with week 4 done, there are no more undefeated teams. I am a firm believer in league-wide parity, which is why I can dick down Schempp and Jeff in back to back weeks, but lose to Bob in week 2. Led by Derek “Billie Joe Armstrong with a bigger forehead " Carr we pull off the upset against Jeff with a little help from Logan Thomas and Mike Williams. Eventually playing QB roulette every week is going to come back to bite me, but for now we’re chilling at third in the power rankings once again. “,
	"record": "3-1",
	"managerName": "Dom"
  },





    {
	"teamName": "Christian Mingle",
	"description": "”Darren Waller helped eek out the win against Steve this week and Quin moves to 3-1. Christian Mingle is missing CMC like Mista Manz misses his nuts. If he’s back this week Andy could be in for the fucking of the century. Sam Darnold sitting on the bench behind Lamar Jackson when he’s clearly the better rushing QB. Talk about affirmative action.   ",
	"record": "3-1",
	"managerName": "Marquin"
  },


  {
	"teamName": "Tim Duncan",
	"description": "Definitely nothing suspicious going on with Dylan and Schempp cum-swapping players back and forth less than a week apart. Clearly not collusion. Extremely fair and cool. Everyone should enjoy the league for now, while we can, because Schempp is gearing up to fuck everyone up the ass. While his team doesn’t look as loaded as in the past, it’s only a matter of time before his players bust out and the Chancellor of Germany takes over the league again.   ",
	"record": "2-2",
	"managerName": "Schempp"
  },


     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Tough break and a close loss for Steven after a true stinker of a game by Tom Brady. Probably stayed up too late the night before the game kissing his son and being afraid of strawberries. Zach Moss grows fat on a rolling stone (the bench), will Steve take the plunge and bench Josh Jacobs for the clearly superior Bills running back or will he continue to rot and sit on his own balls in hell?  ",
	"record": "2-2",
	"managerName": "Steven"
  },

    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "Old Bobby Trees looks like he’s finally coming out of his cage and doin’ just fine. A solid 38.5 point start between Matt Stafford and Woods is a pretty solid beginning to the week, if he can keep it up there’s a chance an upset is in the works. No matter how stupid it is, I find it funny every time I see Bob’s team abbreviation in the ESPN app or in my email inbox. Nothing like reading “GAY has proposed a trade” to put a smile on my face in the morning.    ",
	"record": "2-2",
	"managerName": "Bob"
  },

    {
	"teamName": "Touchdown My Pants",
	"description": "I’m really not sure what Dylan has done to piss off the power rankings voters this week. His team won handedly, he sits 4th in the overall league standings, and yet he drops 2 spots in the power rankings to 8th for week 5. Maybe it has something to do with the 3 voters who voted him for last place. Amazingly it only took 5 weeks for the corrupt voters to abuse the sanctity of the power rankings voting system. Hunter Renfrow looked like a better linebacker than wide receiver last week while Aaron Rodgers looked like a better gay porn star than quarterback.   " ,
	"record": "3-1",
	"managerName": "Dylan"
  },


    {
	"teamName": "Whole Lotta Redzone",
	"description": "Cordarrelle fucking Patterson. Number 3 running back on the year despite averaging less than 7 carries a week. If you say that regression is incoming, then you’re a damn hater. Patterson, Davis and the lads are headed off to London this week to give the Jets a good old fashioned, British arse kicking. Let’s give Andy his flowers for the win this week, he’ll need to keep his dick hard if he wants to beat Marquin in week 5.   ",
	"record": "2-2",
	"managerName": "Andy"
  },  





      {
	"teamName": "Playoff Lenny", 
	"description": "The Bills are so good that Josh Allen was taken out early for Mitchell Trubisky last week. They don’t need his cannon arm to will them to victory every week. Why throw the ball when you could kneel every play against the Texans and still win? Quis might as well drop him and start Jared Goff, at leasts the Lions will be behind and throwing the ball 50 times a game. Tyler “Boyds in Motion” had a stellar game against the Jags. If only he could play every game against teams that have a head coach more concerned with practicing his bowling grip on Ohio St. sophomores’ assholes instead of actually planning a defense like Urban Meyer, then he could be a WR1.   " , 
	"record": "1-3",
	"managerName": "Marquis"

  },


    {
	"teamName": "Tucker? I barely know her",
	"description": "I think it’s time I’d hit the panic button if I were Nick. An unbelievable 556.18 points against so far, that’s about 43 more points per game have been scored on Dylan per week. Injury luck has not been too kind to Nick so far as Gronk and Montgomery are out for extended periods of time and the bench flex options look to be anywhere from lackluster to down right fucking ugly. You’d think Nick would want to trade some of his luxury players like Aaron Jones or Patrick Mahomo to get some more depth, but will he wait too long and dig himself deeper and deeper into the toilet bowl.  ",
	"record": "0-4",
	"managerName": "Nick"
  },




 


    {
	"teamName": "Fuck Me",
	"description": "It has not been Sam’s year thus far in fantasy football. The only team with less than 100 points per game, now riddled with injuries and Calvin Ridley’s “personal issues” Now do you believe me when I tell you about Russell Wilson and the Curse of Ciara’s Pussy? All hope is not lost, he still has Dalvin Cook and Keenan Allen, but with a tough matchup against Schempp this week and Luke and Jeff coming in the next two weeks, things could go from bad to worse very quickly.  ",
	"record": "0-4",
	"managerName": "Sam"
  }





]
