[



  {
	"teamName": "Tim Duncan",
	"description": "First in the opening Power Rankings, but last in our hearts. When will our suffering at the hands of Schempp end? A come from behind victory in the championship game last year followed up by a strong draft this year. Who will be the poor sucker that Schempp will fleece in a trade this year? Who will Alvin Kamara drop 6 touchdowns on this year? Who will Schempp knock out in the playoffs in heart-breaking fashion? Can’t wait to find out. ",
	"record": "0-0",
	"managerName": "Schempp"
  },

    {
	"teamName": "Kareem Pies",
	"description": "It’s time for Sam to experience the curse of Ciara’s pussy as he picked up Russell Wilson as his QB1 this year. Will he get  Mr. Unliiiiiimited? Or will he get the Russell Wilson that was cucked into taking care of Future’s kid (whose name is Future... could you imagine naming your own kid after your stage name? Like Soulja Boy having a kid and deciding to name him Soulja Boy). A lot of teams in our leagues have QB-WR stacks this year, Wilson-Lockett is a pretty damn good one.",
	"record": "0-0",
	"managerName": "Sam"
  },
  
    {
	"teamName": "Christian Mingle",
	"description": "Two years in a row with the number 1 overall pick and CMC, the lottery balls love Marquin almost as much as he loves balls. Christian Mingle has plenty of upside if his picks can stay healthy and on the field. But if the injury bug comes around this year, his team could be shittier than a date night with Odell Beckham. ",
	"record": "0-0",
	"managerName": "Marquin"
  },

     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Damien Harris and Najee Harris and Harris(son) Butker. Just add Kamala and Neil Patrick and you’ve got a real Harris Party going on. The Brady-Evans stack could be lethal if you can distract Tom from making out with his own son long enough to focus on the game. Do you think he got to 2nd base after winning his 7th ring? Kelce is the best TE in the game, I’m shocked he wasn’t picked before 11th overall. ",
	"record": "0-0",
	"managerName": "Steven"
  },


    {
	"teamName": "Red Solo KUPP",
	"description": "Personally, I thought Jeff had the best team coming out of the draft. Barkley and Hopkins in the first two round is obscenely good and I really think Jerry “Judge” Jeudy is primed for a breakout season. Cooper, Kyler, and Logan are quality starting options with first names that sound straight out of a boy band from the early 2000’s. ",
	"record": "0-0",
	"managerName": "Jeff"
  },


  	{
	"teamName": "Corn Julio",
	"description": "Fuck drafting RBs, have you ever heard of drafting Wide Recievers? Somehow I ended up with 4 of the top 5 scoring WRs from the 2018 fantasy season. As someone who habitually lives in the past, this is the ideal team for me. There are some questionable spots on my team and I might be playing running back roulette all year, but after finishing in dead-last place last year the only way is up. It’s about to be comeback-season for the fan favorite team: Corn Julio. ",
	"record": "0-0",
	"managerName": "Dom"
  },




    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "Bob has an unflashy yet solid team. Robert “Bobby Trees” Woods is a pretty strong WR and could get a pretty substantial boost from Stafford replacing Goff in LA. Ekeler and Gibson might be the best RB pair that one team in our league has right now. Callaway and Tony Jones Jr. are some decent bench stashes in the underwater city of New Orleans and if Javonte Williams ends up with the majority of carries in Denver The Team from G.U.N.C.L.E. could be spooky.  ",
	"record": "0-0",
	"managerName": "Bob"
  },

    {
	"teamName": "Show Me Your TD’s",
	"description": "Pretty strong draft from Nick, Mahomes is always a nice pick up - getting him in the 4th round is damn near criminal. It will be interesting to see what will happen in Green Bay’s backfield and how much AJ Dillon might cut into Aaron Jones’ touches. Cole Beasley, notorious vaccine-hater and amateur epidemiologist, might be a valuable bench guy if Buffalo’s offense looks anything like last year. ",
	"record": "0-0",
	"managerName": "Nick"
  },


    {
	"teamName": "Discount Double Check",
	"description": "The Allen-Diggs stack is pretty damn imposing and Jonathan Taylor Thomas is both a strong RB1 and the voice of Young Simba in the 1994 Lion King movie so that’s pretty cool I guess. Diggs, Lamb, and Tyler ‘Certified Lover’ Boyd are a strong group of WRs so Quis’ team could be dangerous. I think it’s time to retire the Discount Double Check name",
	"record": "0-0",
	"managerName": "Marquis"
  },


    {
	"teamName": "Whole Lotta Redzone",
	"description": "Andy with a devastating loss in the championship last year will look to rebound this year and take home 1st place. Chubb, CEH, and Mostert are a pretty solid RB core and Michael Thomas could be a huge boost to the team after he returns from injury. Allen Robinson seemed to do just fine with Trubisky at QB last year so I wouldn’t be worried with the Red Rocket in the pocket, but if/when Justin Fields takes over will ARob be even more valuable? ",
	"record": "0-0",
	"managerName": "Andy"
  },  

    {
	"teamName": "White Justin Fields",
	"description": "Depending on how the Ravens decide to use their limited RBs now with Dobbins and Justice Hill out for the year, drafting the Gus Bus could turn out to be a great decision or a huge hindrance to White Justin Fields. He could be the BangBus and truly fuck the competition, or the Short Bus and really slow down this team’s momentum. A lot of high-ceiling but low-floor WRs, could be a boom or bust team. ",
		"record": "0-0",
	"managerName": "Luke Morrell"
  },


    {
	"teamName": "Touchdown My Pants",
	"description": "The head-scratcher of the draft has to be Chase Edmonds in the 2nd round. Maybe Dylan knows something we all don’t and Edmonds is going to be a stud, but you have to imagine he still would have been on the board in later rounds to draft. Still, former Jeopardy! host Aaron Rodgers and Dalvin Cook provide a pretty strong floor and if Kyle Pitts is as good as advertised he should be a huge upgrade compared to last year’s TE pick in the 5th round.  ",
	"record": "0-0",
	"managerName": "Dylan"
  }




]
