[



  {
	"teamName": "Tim Duncan",
	"description": "He can’t keep getting away with it! Schempp goes absolutely nuts in week 1 to the tune of 168 points and touchdowns all over his lineup. Cooper looked like a dawg on Thursday night and finished the week as the #1 FLEX. Tim Duncan was unanimously voted as the top team in the league this week/ That’s enough to fuck up the poll heatmap script and make Schempp’s square look even blacker than Alvin Kamara. ",
	"record": "1-0",
	"managerName": "Schempp"
  },

      {
	"teamName": "Christian Mingle",
	"description": "Waller with 19 targets on Monday night has to have Quin tweakin’. In the first half it seemed like Carr only threw his direction. Dairy Sanders was unsurprisingly the #1 RB in week 1 and it’s a true testament to Marquin’s drafting strategy to drafting him with the first overall pick. A true clash of titans between Christian Mingle and Tim Duncan in week 2, let’s see if good can triumph over evil.  ",
	"record": "1-0",
	"managerName": "Marquin"
  },

  	{
	"teamName": "Corn Julio",
	"description": "Just when I thought I had 0 running backs, I found out that I actually have 5. Carson, Swift, Ty’son, Melvin, and Henderson all finished in the top 24 RBs in week 1. Is that going to continue all season? No. Is Tyreek going to bail me out every week and catch 197 receiving yards again? No. But it gives me some hope. Give Corn Julio some TP for his bunghole, because we’re shitting on people this year. ",
	"record": "1-0",
	"managerName": "Dom"
  },

     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "A rough start to the season for the Harris boys, but Kelce, Brady, and Chase all put up strong point totals in week 1 and Steve is 1-0. Mike Evans kind of looked like the ugly-step-sister of the Bucs offense in week 1 and was left out of the fun that AB and Godwin had. Lemme Kelce That Pussywill start Sunday behind the woodshed after McLaurin balled out on Thursday but Steve is used to coming from behind, if you catch my drift. ",
	"record": "1-0",
	"managerName": "Steven"
  },


    {
	"teamName": "Red Solo KUPP",
	"description": "Is it time to start worrying about Saquan Barkley? Is Kyler Murray a elite quarterback? Does James Robinson having 5 carries in week 1 make you nervous? A few questions to ponder going into week 2. Nuk was “getting neck till he passed out” and “I swear to God, all [Kyler] did was cash out” last week. We’ll see if Jeff’s team can Shmurda his opponent this week.  ",
	"record": "1-0",
	"managerName": "Jeff"
  },



    {
	"teamName": "Whole Lotta Redzone",
	"description": "Mostert out for the season? Doesn’t matter, Andy is just built different. Robby Anderson looks like if Coolio could ball and looks like he could have some good chemistry with Darnold. Jalen Hurts looked pretty damn strong out there, if Andy correctly called his shot and got an MVP in the 8th round like he said on draft night I will be impressed. However, as we all know Baltimore’s backfield belongs to Ty’son Williams, not Latavius Murray, and Jamaal Williams is just a flash in the pan compared to the lethal D’Andre Swift, so Andy will need to rely on CEH and Chubb going forward and against Dylan in Week 2. ",
	"record": "1-0",
	"managerName": "Andy"
  }, 


    {
	"teamName": "Tucker? I barely know her",
	"description": "Nick can hold his head high this week knowing that he would have beat 9 other teams if he were matched up with them. Unfortunately, Nick was matched up against literally Hitler himself and is off to an 0-1 start. He may have even had a chance if Aaron Jones and Brandon Aiyuk didn’t absolutely piss themselves in combine for a whopping 3.2 points between the two of them. David Montgomery has a name meant for some English nature documentary host on the BBC, but he actually whipped out his BBC on the Rams in Week 1. Better times ahead for Nick.  ",
	"record": "0-1",
	"managerName": "Nick"
  },


   {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "Bob’s respectable 109.9 point output was wrecked by Marquin this week - similar to how Bob can wreck a case of Coors light by himself on a Tuesday evening. Greg the third leg Zuerlein was struggling against Tampa Bay last week and Ekeler was the anti-Waller of the week coming away with 0 targets. The Team From G.U.N.C.L.E has got to get it together and Veer to Victory in Week 2.    ",
	"record": "0-1",
	"managerName": "Bob"
  },





    {
	"teamName": "Kareem Pies",
	"description": "Tough week for Sam as he got run over by the WR train that is Tyreek Hill. Zeke with less than 5 points and only 13 touches is brutal for the number 4 overall pick, enough for Sam to trade him in a blockbuster deal for Dalvin already. I like the trade for Kareem Pies personally, but only time will tell whether giving up on the Wilson-Lockett stack will hurt him in the long run. The last NFL Sunday as a non-married man - mazel tov, bitch. ",
	"record": "0-1",
	"managerName": "Sam"
  }, 



      {
	"teamName": "Playoff Lenny", 
	"description": "TJ Hockensen displayed real big-HOCK energy in week 1 and put up a top-3 TE week. Based on Goff’s absolute refusal to look at a WR more than 7 yards down the field, he could be in for a huge volume of targets this year. A touchdown for Tyler “Boyds are Back in Town” could have pulled out the victory for Quis. Will he trust Joe Burrow against Chicago and start Boyd again, or chase points and plug in Jarvis Landry? Every week has playoff implications, Playoff Lenny.",
	"record": "0-1",
	"managerName": "Marquis"
  },


    {
	"teamName": "Touchdown My Pants",
	"description": "The Jeopardy category is 'Bitch-Made NFC QBs' and the clue 'This Packers QB sucked donkey balls all afternoon against the Saints leading them to a 38-3 loss' The answer would be “Who is Aaron Rodgers?” And Dylan will have to hope that Aaron Rodgers remembers who he is this week after a slew of trades have completely transformed his team since the draft. Dylan is a little suspect at RB now that Chase Edmonds is gone but with solid options at WR and TE, he’s not out of it yet." , 
	"record": "0-1",
	"managerName": "Dylan"
  }

    {
	"teamName": "White Justin Fields",
	"description": "Well we answered last week’s question about Gus Edwards before he even saw the field. A disappointing bus ride capped off by a league-low 76 points in week 1. Luke came out swinging in the trade market and retooled his team already. Maybe a change of scenery will inspire Chase “Second Rounder” Edmonds. “Who else want some of Deebo???” could have been the Niners slogan last week as the Lions got knocked-the-fuck-out by Samuel all game. Luke’s tide could turn this week against Steve. ",
		"record": "0-1",
	"managerName": "Luke Morrell"
  },




]



