[

    {
	"teamName": "Christian Mingle",
	"description": "By the grace of our Lord and Savior, Christian Mingle triumphed over He Who Shall Not Be Named (Schempp). White Jesus continues to put up QB numbers which covers up the gaps at RB2 and Flex, with the lack of depth. We’ll see if no weapon shall prosper once again or if the Kupp’s bring “persecution of the Christians” energy this Sunday.  ",
	"record": "2-0",
	"managerName": "Marquin"
  },

    {
	"teamName": "Red Solo KUPP",
	"description": "Heading into Week 3, the Kupps have the most points scored and undoubtedly the most lopsided team in the entire league. Starting 3 top 10 receivers, having the number 1 quarterback, yet not having a single running back cracking the top 40 has been the formula to a 2-0 start. Will this curved dick of a team continue penetrating the league OR will God smite this unholy abomination down in the matchup with Christian Mingle?",
	"record": "2-0",
	"managerName": "Jeff"
  },

     {
	"teamName": "Lemme Kelce That Pussy",
	"description": "Harris & Co. was on their way to Pussytown (pending trademark once Guy Fieri signs off) when White Justin Fields put up the most points in a game so far this year. The second most points scored squad hosts the stifled Tucker gang who’s looking to avenge being Eiffel Tower’d by his first two opponents. Someone’s leaving here with blue balls. We’ll see if Steve can continue grooming the young receiver in the WR2 slot to another top 24 week. Brady faces his toughest match this week with Stafford and the Rams but more importantly, it’s the battle of quarterbacks whose wives make bigger headlines than them and probably beat them when they get home late from practice.   ",
	"record": "1-1",
	"managerName": "Steven"
  },

  {
	"teamName": "Tim Duncan",
	"description": "Tim Duncan was out there playing like Matt Bonner this week, just an abysmal, weak, soft-dicked display against a truly superior opponent. Did that pathetic performance deter Schempp from voting for himself as the number 1 team in this week’s Power Rankings? You bet your sweet ass it didn’t. If there’s one thing that Simple Schempp has, besides dashing good-looks, rippling muscles, and a kind demeanor, it’s the self-confidence needed to overrate his team and look at his loss as just a minor setback to a major comeback. I fully expect to lose by 50+ this week.   ",
	"record": "1-1",
	"managerName": "Schempp"
  },



  	{
	"teamName": "Corn Julio",
	"description": "Am I salty that I lost by 2 points this week? No. Could Tyler Bass-to-Mouth have made that FG or could Jared Goff have targeted Swift just a few more times to complete the comeback against Bob? Debatable. But just like Ray Lewis said to the Atlanta Police Department in 2000, “Who cares about what happened in the past? Let’s play some damn football.” A matchup with the commander of the Third Reich himself, Schempp, this week is a good test of this team’s resolve and could be indicative of how the rest of the season goes.  ",
	"record": "1-1",
	"managerName": "Dom"
  },


    {
	"teamName": "The Team From G.U.N.C.L.E",
	"description": "Staffords refusal to desegregate his target share didn’t stop Bob from crossing the Mason-Dixon line of victory this past week. Deploying a midget like Ekeler on a weekly basis is symbolic for how this RB stack has come up short and stubby on their value through two weeks. And a bench with the depth of the Heritage High School pom team doesn’t leave this squad with many other options. Let’s see if Sam can take advantage of this matchup by starting the Anti-Gibson much like I wish he’d take advantage of me.    ",
	"record": "1-1",
	"managerName": "Bob"
  },

    {
	"teamName": "White Justin Fields",
	"description": "I appreciate that Luke attempts to negotiate trades in the group chat, so we can all marvel at the lengths this man would go through to try to get CMC. Henry, Jefferson and McLaurin for McCaffrey and I’m sure if he offered to suck Marquin off too he might actually get the deal done. But until that happens, Luke will have to be content with Derrick Henry putting up a modest 44.7 points this week and carrying White Justin Fields to this week’s highest point total. Shoutout to the kicker, Brandon “Ronald McDonald’s Asshole” McManus for starting the season 5 for 5.  ",
		"record": "1-1",
	"managerName": "Luke"
  },

      {
	"teamName": "Playoff Lenny", 
	"description": "Quis snatched victory from Sam last week like CeeDee Lamb snatched his phone back from his girlfriend in last year’s draft. Josh Allen may look good in shorts, but he certainly hasn’t looked good thus far from a fantasy QB perspective. Playoff Lenny has a chance to start the season 2-1 and firmly grasp a spot in the playoff picture. If he does, our league will be getting dominated by the Evans brothers, just like the white women of Heritage High School circa 2012. " , 
	"record": "1-1",
	"managerName": "Marquis"

  },



    {
	"teamName": "Whole Lotta Redzone",
	"description": "Andy loses in Week 2 to Dylan and falls into a pit of Clyde Edwards-Despair, immediately shipping out his 15th overall pick to White Justin Fields in exchange for Sutton and Mike Davis. Talk about selling low. Mr. 2 Last Names himself, Allen Robinson, has started the year extremely slow, but with the Black Luke Morrell starting at QB this week for Chicago, maybe his luck will change.  ",
	"record": "1-1",
	"managerName": "Andy"
  },  




    {
	"teamName": "Tucker? I barely know her",
	"description": "It seems a bit unfair for Nick to be 0-2 and this far down on the Power Rankings while scoring almost the exact same amount of points as Marquin thus far, except with 131 more Points Against in just two weeks. Kyle Shannahan has pretty much banished Brandon Aiyuk to the shadow realm, a tough look for your 5th round pick to only have 1 reception for 6 yards in two weeks. This week’s matchup looks like Steve Jackson vs. Mahomes. Jackson-Mahomes. Fitting considering how gay the two owners involved are.  ",
	"record": "0-2",
	"managerName": "Nick"
  },




    {
	"teamName": "Touchdown My Pants",
	"description": "Dylan grabbed a handful of Rodgers hair and skullfucked his way to a sizeable victory against Whole Lotta Redzone (Slatttt++). Will the acquisition of woman-beater Hunt, allegedly, and the fourth coolest person to come out of Kalamazoo (behind Terry “MAGA” Crews, Tim “Pound of Coke” Allen, and GRRRAAIIGG JEEENNNIINNGGSSS) Corey Davis continue to turn the tide for the least popular 1-1 team in the league? Let’s see if Marquis doesn’t blow his back out this weeked….. unless?" ,
	"record": "1-1",
	"managerName": "Dylan"
  },


       {
	"teamName": "You Sunk My Blankenship",
	"description": "”Something Lost, Something Gained” in this case refers to Tyler Lockett as he is immediately traded back into Sam’s loving arms after a one week stay at his step-father Dylan’s house (who he will NEVER call Dad). It really shows how little we know about fantasy when Sam was ranked as the number 2 team after the draft and is now in last place, but it’s still earlier than a white family at the airport. There is plenty of time for Sam to turn the season around lest we all feel his Russian Rampage once more.   ",
	"record": "0-2",
	"managerName": "Sam"
  }




]



